# todo 第 4 章 流程控制语句

## 1. if else 语句
# age = 18
# if age >= 18:
#     print("你已经成年了")
# elif age == 17:
#     print("你快成年了")
# else:
#     print("你还未成年")

# age = int(input('请输入你的年龄：'))
# print(age)
# if 18<= age <= 65:
#     print("你已经成年了")



## 2. 循环:分为 while 和 for 循环
# n = 1
# while n <= 10:
#     print(f'第{n}次你好啊')
#     n += 1
# print(f'我是while循环以外的代码，执行到这里时，循环已经结束了，此时的n是：{n}')

# n = 100
# for n in range(1, 11):
#     print(f'第{n}次你好啊')
# print(f'我是for循环以外的代码，执行到这里时，循环已经结束了，此时的n是：{n}')

# # 加密代码
# text = input('📝请输入要加密的文字：')
# secret = ''
# for t in text:
#     secret += chr(ord(t) + 1) # 对 Unicode 编码加一
# print(f'㊙️经过加密后的内容为：{secret}')


# 多层循环
# day = 1
# for day in range(1,31):
#     print(f'********📅第{day}天********')
#     for group in range(1,4):
#         print(f'💪这是第{group}组仰卧起坐')
#     print(f'✅第{day}天任务已完成！明天继续！\n')
# print(f'🎉为期{day}天的健身计划完成，我的腹肌在闪闪发光！')


# for循环实现九九乘法表
for row in range(1, 10):
    for item in range(1, row + 1):
        print(f'{item}*{row}={item * row}', end='\t')
    print()